;;;; appr-func-temptate.lisp

(in-package #:math)

(annot:enable-annot-syntax)

@export
@doc
"Аргументы для функции одного параметра."
(defparameter *apr-args-1* '(x1 yy))

@export
@doc
"Аргументы для функции двух параметров."
(defparameter *apr-args-2* '(x1 x2 yy))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

@export
@doc
 "Шаблон для построения линейной функции одного параметра: x1 с двумя коэффициентами."
(defparameter *apr-func-1-2* '((x1) (1.0) (yy)))

@export
@doc
"Шаблон для построения квадратичной функции одного параметра: x1 c тремя коэффициентами."
(defparameter *apr-func-1-3* '((x1 x1) (x1) (1.0) (yy)))

@export
@doc
"Шаблон для построения квадратичной функции одного параметра: x1 c четырьмя коэффициентами."
(defparameter *apr-func-1-4* '((x1 x1 x1) (x1 x1) (x1) (1.0) (yy)))

@export
@doc
"Шаблон для построения квадратичной функции одного параметра: x1 c пятью коэффициентами."
(defparameter *apr-func-1-5* '((x1 x1 x1 x1) (x1 x1 x1) (x1 x1) (x1) (1.0) (yy)))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

@export
@doc
"@b(Описание:) *apr-func-2-4* шаблон для построения функции двух параметров: 
x1 и x2 c четырьмя коэффициентами."
(defparameter *apr-func-2-4* '((x1 x2) (x1) (x2) (1.0) (yy)))

@export
@doc
"@b(Описание:) *apr-func-2-5* шаблон для построения функции двух параметров: 
x1 и x2 c пятью коэффициентами."
(defparameter *apr-func-2-5* '((x1 x1) (x2 x2)         (x1) (x2) (1.0) (yy)))

@export
@doc
"@b(Описание:) *apr-func-2-6* шаблон для построения функции двух параметров: x1 и x2 c шестью коэффициентами."
(defparameter *apr-func-2-6* '((x1 x1) (x2 x2) (x1 x2) (x1) (x2) (1.0) (yy)))

@export
@doc
"@b(Описание:) *apr-func-2-7* шаблон для построения функции двух параметров: x1 и x2 c семью коэффициентами."
(defparameter *apr-func-2-7* '((x1 x1 x2) (x1 x2 x2) (x1 x1) (x2 x2) (x1) (x2) (1.0) (yy)))

@export
@doc
"@b(Описание:) *apr-func-2-8* шаблон для построения функции двух параметров: x1 и x2 c восемью коэффициентами."
(defparameter *apr-func-2-8* '((x1 x1 x2) (x1 x2 x2) (x1 x1) (x2 x2) (x1 x2) (x1) (x2) (1.0) (yy)))

@export
@doc
"Шаблон для построения функции двух параметров: x1 и x2 c девятью коэффициентами."
(defparameter *apr-func-2-9* '((x1 x1 x2 x2) (x1 x1 x2) (x1 x2 x2) (x1 x1) (x2 x2) (x1 x2) (x1) (x2) (1.0) (yy)))
